package Lesson12;

import java.util.Scanner;

/**
 * Created by velfor on 04.06.2022.
 */
public class Main {
    public static void main(String[] args) {
        // 1 начальное значение переменной в условии
        // 2 условие продолжения цикла
        // 3 последння команда в цикле - изменение переменной в условии
        // Дан массив целых чисел, диапазон от -20 до 5. Найти первый
        //положительный элемент и его номер
        /*Scanner in = new Scanner(System.in);
        System.out.print("Введите кол-во элементов массива ");
        int size = in.nextInt();
        int arr[] = new int[size];
        for(int i=0; i < size; i++){//int i появилось адрес 4528
            arr[i] = (int)(Math.random()*26 - 15);
            System.out.print(arr[i] + " ");
        }// int i 4528 уничтожено
        int i = 0;// новый i c адресом 8974
        while(arr[i] <= 0){
            i++;
        }
        if (i == size){
            System.out.println("Нет положительных ");
        }
        else {
            System.out.println("\nПервый положительный " + arr[i] +
        " номер " + i);
        }*/
    }// уничтожен i c адресом 8974
}
